#### Terraform Plan 📖
```module.layer.data.archive_file.layer_zip: Reading...
module.api.data.archive_file.update-function-zip: Reading...
module.api.data.archive_file.create-function-zip: Reading...
module.api.data.archive_file.delete-function-zip: Reading...
module.alarm-trigger.data.archive_file.trigger-function-zip: Reading...
module.api.data.archive_file.create-function-zip: Read complete after 0s [id=ede30d944c1defe12a7bb7db4f467f3250f78cf8]
module.alarm-trigger.data.archive_file.trigger-function-zip: Read complete after 0s [id=26020d5d9817e8ac4a323330a66e052733c5a88e]
module.api.data.archive_file.update-function-zip: Read complete after 0s [id=9046ada8f333d203d99daabe9317d14516f62e81]
module.api.data.archive_file.delete-function-zip: Read complete after 0s [id=1012d83b1cdbb66c25d8325819341f48a8cca17a]
module.api.data.aws_region.current: Reading...
module.alarm-trigger.data.aws_caller_identity.current: Reading...
module.api.data.aws_caller_identity.current: Reading...
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Reading...
module.api.aws_api_gateway_api_key.api-key-dev: Refreshing state... [id=mtw89qlbs2]
module.api.aws_cloudwatch_log_group.throwtrash-alarm-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm]
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=ylt5sxzsod]
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Read complete after 0s [id=52247394]
module.alarm-trigger.data.aws_region.current: Reading...
module.alarm-trigger.aws_cloudwatch_log_group.throwtrash-alarm-trigger-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-trigger]
module.api.aws_scheduler_schedule_group.throwtrash-alarm-schedule-group: Refreshing state... [id=throwtrash-alarm-schedule-group]
module.alarm-trigger.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api-gateway-prod-stage[0].aws_api_gateway_domain_name.api-domain-name: Refreshing state... [id=alarm.mythrowaway.net]
module.api.aws_dynamodb_table.throwtrash-alarm-table: Refreshing state... [id=throwtrash-alarm]
module.api.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.alarm-trigger.data.aws_caller_identity.current: Read complete after 1s [id=188970983837]
module.alarm-trigger.aws_iam_role.throwtrash-alarm-trigger-lambda-role: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role]
module.api.aws_iam_role.throwtrash-alarm-lambda-role: Refreshing state... [id=throwtrash-alarm-lambda-role]
module.api.aws_iam_role.throwtrash-alarm-scheduler-role: Refreshing state... [id=throwtrash-alarm-scheduler-role]
module.api-gateway-prod-stage[0].aws_route53_record.route53-record: Refreshing state... [id=Z5UYE2IX50J9A_alarm.mythrowaway.net_A]
module.api.aws_api_gateway_resource.api-resource-create: Refreshing state... [id=wipuw0]
module.api.aws_api_gateway_resource.api-resource-update: Refreshing state... [id=k5ktnr]
module.api.aws_api_gateway_resource.api-resource-delete: Refreshing state... [id=nkks0s]
module.api.aws_api_gateway_method.api-method-post: Refreshing state... [id=agm-ylt5sxzsod-wipuw0-POST]
module.api.aws_api_gateway_method.api-method-put: Refreshing state... [id=agm-ylt5sxzsod-k5ktnr-PUT]
module.api.aws_api_gateway_method.api-method-delete: Refreshing state... [id=agm-ylt5sxzsod-nkks0s-DELETE]
module.api.aws_iam_policy.throwtrash-alarm-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-lambda-policy]
module.api-gateway-prod-stage[0].aws_api_gateway_deployment.api-deployment-prod: Refreshing state... [id=uuaip0]
module.api.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-lambda-role-20240429132809078300000002]
module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v1: Refreshing state... [id=ags-ylt5sxzsod-v1]
module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping: Refreshing state... [id=alarm.mythrowaway.net/]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v1: Refreshing state... [id=u56dai]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.layer.data.archive_file.layer_zip: Read complete after 3s [id=d06d78799e834c0cbfeb52c1ed575013ab93ac21]
module.layer.aws_lambda_layer_version.layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:14]
module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda: Refreshing state... [id=throwtrash-alarm-trigger]
module.api.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0]: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod]
module.alarm-trigger.aws_iam_policy.throwtrash-alarm-trigger-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-trigger-lambda-policy]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:dev]
module.api.aws_iam_policy.throwtrash-alarm-scheduler-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-scheduler-policy]
module.api.aws_lambda_function.throwtrash-alarm-update-lambda: Refreshing state... [id=throwtrash-alarm-update]
module.api.aws_lambda_function.throwtrash-alarm-create-lambda: Refreshing state... [id=throwtrash-alarm-create]
module.api.aws_lambda_alias.throwtrash-delete-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:dev]
module.api.aws_api_gateway_integration.api-integration-delete: Refreshing state... [id=agi-ylt5sxzsod-nkks0s-DELETE]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v1]
module.api.aws_iam_role_policy_attachment.scheduler-policy-attachment: Refreshing state... [id=throwtrash-alarm-scheduler-role-20240429131751028900000001]
module.alarm-trigger.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role-20240429131751105100000002]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v1: Refreshing state... [id=terraform-20240429134931498100000001]
module.api.aws_lambda_permission.throwtrash-delete-permission-apigw: Refreshing state... [id=terraform-20240429131802029300000004]
module.api.aws_lambda_alias.throwtrash-create-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:dev]
module.api.aws_api_gateway_integration.api-integration-create: Refreshing state... [id=agi-ylt5sxzsod-wipuw0-POST]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v1]
module.api.aws_lambda_alias.throwtrash-update-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:dev]
module.api.aws_api_gateway_integration.api-integration-update: Refreshing state... [id=agi-ylt5sxzsod-k5ktnr-PUT]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v1]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v1: Refreshing state... [id=terraform-20240429134931504000000002]
module.api.aws_lambda_permission.throwtrash-create-permission-apigw: Refreshing state... [id=terraform-20240429132817896500000004]
module.api.aws_lambda_permission.throwtrash-update-permission-apigw: Refreshing state... [id=terraform-20240429132827320000000006]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v1: Refreshing state... [id=terraform-20240429134931543400000003]
module.api.aws_api_gateway_deployment.api-deployment-dev: Refreshing state... [id=78em6t]
module.api.aws_api_gateway_stage.api-stage-dev: Refreshing state... [id=ags-ylt5sxzsod-dev]
module.api.aws_api_gateway_usage_plan.usage-plan-dev: Refreshing state... [id=4hwsh7]
module.api.aws_api_gateway_usage_plan_key.api-plan-key-dev: Refreshing state... [id=mtw89qlbs2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0] will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-trigger-prod" {
      ~ function_version = "1" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod"
        name             = "prod"
        # (4 unchanged attributes hidden)
    }

  # module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-trigger-lambda" {
        id                             = "throwtrash-alarm-trigger"
      ~ last_modified                  = "2024-05-02T11:49:41.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:1/invocations" -> (known after apply)
      ~ source_code_hash               = "YjsmOx35A/xuHtVqLpcmho4j00lXEz0tEUK2/1jaJ/Q=" -> "GAUhNRz6cPtX+4j8u78gsBQibi+rm0tDHaCuyA6Qi0M="
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "1" -> (known after apply)
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-create-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-create-lambda" {
        id                             = "throwtrash-alarm-create"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:2/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "2" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:2/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "2" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-update-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-update-lambda" {
        id                             = "throwtrash-alarm-update"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:2/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "2" -> (known after apply)
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v1 will be updated in-place
  ~ resource "aws_api_gateway_stage" "api-stage-prod-v1" {
      ~ deployment_id         = "g7aws4" -> "uuaip0"
        id                    = "ags-ylt5sxzsod-v1"
        tags                  = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
        # (14 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v1 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-create-alias-v1" {
      ~ function_version = "2" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v1"
        name             = "v1"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v1 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-delete-alias-v1" {
      ~ function_version = "2" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v1"
        name             = "v1"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v1 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-update-alias-v1" {
      ~ function_version = "2" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v1"
        name             = "v1"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v1 must be replaced
-/+ resource "aws_lambda_permission" "throwtrash-create-permission-apigw-v1" {
      ~ id                  = "terraform-20240429134931504000000002" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:ap-northeast-1:188970983837:ylt5sxzsod/*/POST/create" -> "arn:aws:execute-api:ap-northeast-1:188970983837:ylt5sxzsod/v1/POST/create" # forces replacement
      ~ statement_id        = "terraform-20240429134931504000000002" -> (known after apply)
      ~ statement_id_prefix = "terraform-" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v1 must be replaced
-/+ resource "aws_lambda_permission" "throwtrash-delete-permission-apigw-v1" {
      ~ id                  = "terraform-20240429134931498100000001" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:ap-northeast-1:188970983837:ylt5sxzsod/*/POST/delete" -> "arn:aws:execute-api:ap-northeast-1:188970983837:ylt5sxzsod/v1/POST/delete" # forces replacement
      ~ statement_id        = "terraform-20240429134931498100000001" -> (known after apply)
      ~ statement_id_prefix = "terraform-" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v1 must be replaced
-/+ resource "aws_lambda_permission" "throwtrash-update-permission-apigw-v1" {
      ~ id                  = "terraform-20240429134931543400000003" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:ap-northeast-1:188970983837:ylt5sxzsod/*/POST/update" -> "arn:aws:execute-api:ap-northeast-1:188970983837:ylt5sxzsod/v1/POST/update" # forces replacement
      ~ statement_id        = "terraform-20240429134931543400000003" -> (known after apply)
      ~ statement_id_prefix = "terraform-" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 9 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.```